---
kind: property
id: P:Autodesk.Revit.DB.GraphicsStyle.GraphicsStyleCategory
source: html/a46641a8-932b-7cf0-5b52-52b832aa4dff.htm
---
# Autodesk.Revit.DB.GraphicsStyle.GraphicsStyleCategory Property

The graphics style category.

## Syntax (C#)
```csharp
public Category GraphicsStyleCategory { get; }
```